app/views/plants/show.html.erb

        </div>
        <% @plant.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" INNER JOIN "bookings" ON "reviews"."booking_id" = "bookings"."id" WHERE "bookings"."plant_id" = $1  [["plant_id", 54]]