app/controllers/bookings_controller.rb

  def index
    @my_bookings = Booking.where(user: current_user)
    @requested_bookings = Booking.select{|booking| booking.plant.user == current_user}
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 3]]
SELECT "bookings".* FROM "bookings"
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def show
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def new
    @plant = Plant.find(params[:plant_id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]

  def create
    @booking = Booking.new(booking_params)
    @plant = Plant.find(params[:plant_id])
    @booking.plant = @plant
    @booking.user = current_user
    if @booking.save
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
INSERT INTO "bookings" ("start_date", "end_date", "total_price", "plant_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
      @booking = Booking.find(params[:id])
      @booking.update(booking_params)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", "declined"], ["updated_at", "2020-12-05 14:46:32.688190"], ["id", 23]]