app/controllers/pages_controller.rb

SELECT "plants".* FROM "plants" ORDER BY "plants"."id" ASC LIMIT $1  [["LIMIT", 3]]
---
  def home
    @plants = Plant.all.first(3)