app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
  def show
    @plant = Plant.find(params[:id])

INSERT INTO "plants" ("name", "description", "price", "address", "user_id", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @plant = Plant.new(plant_params)
    @plant.user = current_user
    if @plant.save